{
  "id": "aged-eggnog",
  "title": "Aged Eggnog",
  "source_url": "https://altonbrown.com/recipes/aged-eggnog/",
  "yield_servings": 10,
  "total_time_min": 86415,
  "tags": [
    "beverage",
    "christmas",
    "party",
    "no-cook",
    "make ahead",
    "aged",
    "vegetarian"
  ],
  "ingredients": [
    {"name": "egg yolks (about 12 large eggs)", "amount_g": 216, "amount_oz": 7.6},
    {"name": "sugar", "amount_g": 454, "amount_oz": 16},
    {"name": "freshly grated nutmeg, plus more for garnish", "amount_g": 2, "amount_oz": 0.07},
    {"name": "half-and-half", "amount_g": 473, "amount_oz": 16.7},
    {"name": "whole milk", "amount_g": 473, "amount_oz": 16.7},
    {"name": "heavy cream", "amount_g": 473, "amount_oz": 16.7},
    {"name": "Jamaican rum", "amount_g": 237, "amount_oz": 8.4},
    {"name": "cognac", "amount_g": 237, "amount_oz": 8.4},
    {"name": "bourbon", "amount_g": 237, "amount_oz": 8.4},
    {"name": "kosher salt", "amount_g": 1.5, "amount_oz": 0.05}
  ],
  "steps": [
    "Separate the eggs and store the whites for another application.",
    "Beat the yolks with the sugar and nutmeg in a large mixing bowl until the mixture lightens in color and falls off the whisk in a solid ribbon.",
    "Combine dairy (half-and-half, milk, cream), booze (rum, cognac, bourbon), and salt in a second bowl or pitcher.",
    "Slowly beat the dairy-booze mixture into the egg mixture until fully combined.",
    "Transfer to a large glass jar (or a couple of smaller ones) and store in the refrigerator.",
    "Age for a minimum of 2 months for best results.",
    "Serve in mugs or cups topped with freshly grated nutmeg."
  ],
  "notes": [
    "The alcohol 'cooks' the eggs over time, making this safe to drink despite raw eggs",
    "Can be aged for 2 weeks minimum, but 2 months is preferred - a year is possible if you can wait",
    "Use pasteurized eggs if you want extra peace of mind",
    "The mix of three spirits (rum, cognac, bourbon) adds depth and complexity",
    "Save the egg whites for meringue, angel food cake, or cocktails",
    "Descends from English sack posset, a thick beverage made with eggs, milk, and fortified wine"
  ],
  "created_at": "2025-11-25",
  "last_updated_at": "2025-11-25"
}
