{
  "id": "akayu-spicy-miso-ball",
  "title": "Akayu Spicy Miso Ball",
  "source_url": null,
  "yield_servings": null,
  "total_time_min": 15,
  "tags": ["topping", "ramen", "japanese", "condiment", "miso", "spicy", "hot", "akayu"],
  "ingredients": [
    {
      "name": "garlic",
      "amount_g": 80,
      "amount_oz": 2.8
    },
    {
      "name": "Thai Bird Chilis (or other fresh red chilis)",
      "amount_g": 40,
      "amount_oz": 1.4
    },
    {
      "name": "vegetable oil",
      "amount_g": 5,
      "amount_oz": 0.18
    },
    {
      "name": "fish powder (optional)",
      "amount_g": 3,
      "amount_oz": 0.11
    },
    {
      "name": "white miso",
      "amount_g": 60,
      "amount_oz": 2.1
    },
    {
      "name": "brown miso",
      "amount_g": 60,
      "amount_oz": 2.1
    },
    {
      "name": "fine Korean chili powder (add more for more heat)",
      "amount_g": 10,
      "amount_oz": 0.35
    }
  ],
  "steps": [
    "Combine the garlic and chilis in the bowl of a food processor. Process until a fine paste.",
    "Add the paste to a skillet with the oil, and cook over medium heat, until the garlic's pungency has subsided considerably, and the vegetables have released most of their moisture, around 5 minutes.",
    "Add the fish powder if using, bloom it with the chili and garlic mixture over medium heat, around 1 minute.",
    "Combine the garlic/chili paste with the remaining ingredients (white miso, brown miso, and Korean chili powder).",
    "Use around 30-40 g per bowl (but personal preference rules here)."
  ],
  "notes": [
    "This is a recipe derived from a topping created by a shop called Ryushanhai in the Yamagata prefecture of Japan in 1960.",
    "It's meant to top Akayu style bowls of ramen, but can be used in a host of other applications, especially if you're a glutton for spice.",
    "This may not be 100% in line with the traditional style, but it has noticeable heat.",
    "It's fun to slowly stir into the soup as you consume it.",
    "Don't worry too much about the quality of the miso you use here - it's mostly for body and salt, and acts as a backdrop to the primary flavors of garlic and spice.",
    "Adjust the amount of Korean chili powder to your desired heat level.",
    "Other fresh red chilis can work in place of Thai Bird Chilis.",
    "Store leftovers in the refrigerator in an airtight container."
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}
