{
  "id": "chashu-standard-braise",
  "title": "Chashu - Standard Braise",
  "source_url": null,
  "yield_servings": null,
  "total_time_min": 240,
  "tags": ["topping", "ramen", "japanese", "chashu", "pork", "protein", "belly", "shoulder", "oven", "braised"],
  "ingredients": [
    {
      "name": "pork belly or shoulder",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "salt",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "black pepper",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "mirin",
      "amount_g": 125,
      "amount_oz": 4.4
    },
    {
      "name": "soy sauce",
      "amount_g": 125,
      "amount_oz": 4.4
    },
    {
      "name": "water",
      "amount_g": 250,
      "amount_oz": 8.8
    },
    {
      "name": "brown sugar",
      "amount_g": 12.5,
      "amount_oz": 0.44
    },
    {
      "name": "sake",
      "amount_g": 60,
      "amount_oz": 2.1
    },
    {
      "name": "garlic cloves, smashed",
      "amount_g": null,
      "amount_oz": null
    }
  ],
  "steps": [
    "Preheat your oven to 110째C (225째F).",
    "Heat a large, oven-safe vessel that you can sear in over medium heat. Cast iron or an enameled dutch oven works great here, but any oven-safe pot or pan will work.",
    "Season the exterior of the pork with salt and pepper on all sides.",
    "Place the pork in the heated pan and sear on all sides until golden brown, around 4-5 minutes per side.",
    "Some fat will render as the pork cooks. With a paper towel, sop up residual fat.",
    "Meanwhile, in a small bowl, combine mirin, soy sauce, water, and brown sugar. Stir to dissolve the brown sugar. Then add the garlic. At this stage, you could also add other aromatics like ginger, or green onion.",
    "Deglaze the pan with the sake, then add in the ingredients from step 6.",
    "Bring the liquid to a boil, then cover the vessel.",
    "Place the vessel into the oven, and braise, occasionally turning the pork every hour or so, until the pork is quite tender, and the internal temperature reaches around 93째C (200째F).",
    "Remove, allow to cool, then place in the fridge with the cooking liquid, and chill to allow for easy slicing."
  ],
  "notes": [
    "This is often the author's preferred method for making chashu.",
    "The pork is really tender, to the point that it actually becomes difficult to pick up with chopsticks.",
    "If you're into extremely luscious texture, this method is for you.",
    "You can mix things up by adding green onion, ginger, garlic, or other aromatics to your braising liquid.",
    "Flavorful and relatively easy compared to other methods.",
    "Some monitoring required during braising.",
    "Turn the pork every hour or so to ensure even cooking.",
    "The braising liquid can be saved and reused as a tare component."
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}
