{
  "id": "chashu-combination-braise-roast",
  "title": "Chashu - Combination Braise then Roast",
  "source_url": null,
  "yield_servings": null,
  "total_time_min": 210,
  "tags": ["topping", "ramen", "japanese", "chashu", "pork", "protein", "belly", "stovetop", "oven", "braised", "roasted"],
  "ingredients": [
    {
      "name": "pork belly (shoulder is less successful)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "mirin",
      "amount_g": 60,
      "amount_oz": 2.1
    },
    {
      "name": "soy sauce",
      "amount_g": 125,
      "amount_oz": 4.4
    },
    {
      "name": "water",
      "amount_g": 250,
      "amount_oz": 8.8
    },
    {
      "name": "brown sugar",
      "amount_g": 25,
      "amount_oz": 0.88
    },
    {
      "name": "sake",
      "amount_g": 60,
      "amount_oz": 2.1
    },
    {
      "name": "garlic cloves, smashed",
      "amount_g": null,
      "amount_oz": null
    }
  ],
  "steps": [
    "Add all ingredients to a saucepan large enough to hold the pork, but small enough to allow for the pork to be submerged.",
    "Bring the liquid to a boil, then cover the vessel.",
    "Continue to cook the pork at a simmer until tender, or the internal temperature registers above 95°C (203°F), around 2-3 hours (though the thickness of your pork belly will increase this cooking time). When in doubt, probe the pork belly to make sure the texture is appropriate - it should be soft, yielding, and jiggly.",
    "Remove the pork and place it on a wire rack set in a baking sheet. Reserve the liquid in a container of your choice that will be big enough to hold the pork as well.",
    "Preheat your oven as high as it goes (the hotter the better), for at least 30 minutes. This gives the pork time to dry, to cool, and ensures the oven is hot sufficiently to char the surface when the pork goes in.",
    "When the oven is heated, place the pork in the oven and roast for 5-10 minutes, or until the exterior of the pork is dark, rusted, and bubbling.",
    "Remove the pork from the oven. Place the hot pork back into the braising liquid in the container.",
    "Allow to cool to room temperature, then let chill overnight in the fridge before slicing."
  ],
  "notes": [
    "This method combines both braising and roasting approaches to get the ideal results for each.",
    "Combines the deeply caramelized exterior of roasted pork with the melty quality of braised meat.",
    "The term 'chashu' is derived from Cantonese style BBQ pork after all.",
    "Since the pork sits out of the braising liquid while the oven preheats, the surface gradually becomes dry and slightly tacky from the sugar, causing the surface to caramelize very quickly.",
    "A quick blast in the oven is all it takes.",
    "This method is less successful with shoulder - belly is preferred.",
    "Balances great char and flavor.",
    "Uniquely tacky surface reminiscent of Chinese BBQ.",
    "Most technically involved of the chashu cooking options."
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}
