{
  "id": "chicken-fat-stovetop",
  "title": "Chicken Fat - Stovetop Method",
  "source_url": null,
  "yield_servings": null,
  "total_time_min": 45,
  "tags": [
    "aroma oil",
    "oil",
    "fat",
    "ramen",
    "japanese",
    "chicken fat",
    "schmaltz",
    "stovetop",
    "chicken"
  ],
  "ingredients": [
    {
      "name": "chicken skin",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "water",
      "amount_g": 23,
      "amount_oz": 0.81
    }
  ],
  "steps": [
    "Add the chicken skin and water to a pan and heat over medium heat. You can omit the water if you'd like the additional flavor browning provides.",
    "For traditional rendering without browning: Cook with water for approximately 45 minutes, replacing water as needed. The water creates a temperature ceiling at the boiling point, preventing browning. Kill the heat and allow the fat to separate.",
    "For additional browning flavor (optional): Don't add additional water, and cook the water off. Allow the skins to fry in their own fat until they take on a golden brown color, approximately 45 minutes.",
    "Strain the rendered fat and reserve the crispy skins as desired.",
    "If not using the oil immediately, keep in the fridge for up to 6 months."
  ],
  "notes": [
    "Chicken fat is sometimes called 'schmaltz' and is made from chicken skin most frequently.",
    "Traditional stovetop method uses water to prevent browning by keeping temperature below the boiling point.",
    "Water conducts heat well and creates a temperature ceiling, preventing the skin from browning while still rendering the fat.",
    "You can use the fat that renders out of chicken skin while making soup, which has the additional benefit of the skin contributing collagen to the soup.",
    "The negative of rendering fat during soup-making is that the soup's oil-soluble aromatics will flavor the final fat.",
    "Store in the fridge for up to 6 months."
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}
