{
  "id": "iekei-noodle",
  "title": "Iekei Noodle",
  "source_url": null,
  "yield_servings": 1,
  "total_time_min": 90,
  "tags": ["noodles", "ramen", "japanese", "iekei", "yoshimuraya", "reverse-cut", "low-hydration"],
  "ingredients": [
    {
      "name": "King Arthur all purpose flour (or Galahad)",
      "amount_g": 100,
      "amount_oz": 3.53
    },
    {
      "name": "water",
      "amount_g": 31,
      "amount_oz": 1.09
    },
    {
      "name": "salt",
      "amount_g": 1,
      "amount_oz": 0.04
    },
    {
      "name": "baked soda or powdered kansui",
      "amount_g": 1.2,
      "amount_oz": 0.04
    },
    {
      "name": "riboflavin for color",
      "amount_g": 0.01,
      "amount_oz": 0.0
    }
  ],
  "steps": [
    "Add baked soda and salt to the water, dissolve completely. Go slowly, stir constantly until clear. This will take a while, but eventually, the contents will dissolve. You can make the solution several days before to get a jumpstart, just hold the liquid in an airtight container.",
    "In a standing mixer with a paddle attachment, add your flour, Turn the mixer to \"stir\" and run for 2 minutes to aerate the mix.",
    "While running the mixer on stir, add two thirds of your water mixture slowly, in an even stream. Let the mixer stir the flour and water mixture for 4 minutes.",
    "Add in the remaining water mixture with the mixer running, run for another minute, until the dough is homogenous and no longer sandy, around 5 more minutes.",
    "If using a professional machine, immediately press in the following intervals: 1.5 mm, 2 mm compound, 3 mm. If at home, step on the dough, repeatedly, until the dough is homogenous.",
    "After kneading, put the dough back in the plastic bag, and rest at room temp for another 30 minutes.",
    "Pull out your dough. Portion into workable sizes, and roll out to desired thickness using the pasta machine, using potato or cornstarch as you go to prevent sticking. In this case, the dough should be 2 mm thick.",
    "Grab a sheet around 6 inches long, and cut into noodles approximately 1.5 mm wide, with a cutter.",
    "Bundle the noodles into 140 g portions and place them in a sealable bag. Put the bag in the fridge and allow it to rest for at least a day."
  ],
  "notes": [
    "This recipe is an attempt at replicating the noodle made by Sakai Seimen for Iekei style noodles, most notably those served at Yoshimuraya",
    "Denoted by being \"reverse cut,\" or cut using a cutter notably thinner than the thickness of the dough (1.5mm gaps, but with a dough thickness of 2mm)",
    "This recipe was designed for professional noodle machines (Yamato at the restaurant), so it may be difficult to attempt at home",
    "If using powdered kansui, use 0.7g potassium carbonate and 0.5 g sodium carbonate",
    "King Arthur Galahad is preferred if possible",
    "Rest in fridge for at least 1 day before use"
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}
