{
  "id": "iekei-soup",
  "title": "Iekei Soup",
  "source_url": null,
  "yield_servings": 12,
  "total_time_min": 1000,
  "tags": ["soup", "broth", "paitan", "cloudy soup", "japanese", "ramen", "pork", "chicken", "iekei", "yokohama"],
  "ingredients": [
    {
      "name": "pork neck bones",
      "amount_g": 1000,
      "amount_oz": 35.3
    },
    {
      "name": "pork femurs, split to expose marrow",
      "amount_g": 1000,
      "amount_oz": 35.3
    },
    {
      "name": "chicken backs",
      "amount_g": 1000,
      "amount_oz": 35.3
    },
    {
      "name": "pork trotter (half)",
      "amount_g": 500,
      "amount_oz": 17.6
    },
    {
      "name": "garlic cloves (optional)",
      "amount_g": 24,
      "amount_oz": 0.85
    },
    {
      "name": "water",
      "amount_g": 6000,
      "amount_oz": 211.6
    }
  ],
  "steps": [
    "Add all pork bones to a pot with fresh water. Bring to a boil, then down to a simmer, and skim the scum that rises to the top. Do this for 15-20 minutes, or until little scum is rising. The scum goes through several phases - you'll know when it's done rising. This blanch is integral for a white tonkotsu.",
    "Cook at a medium boil for 10 hours, stirring frequently.",
    "Add the chicken, cook for an additional 6 hours.",
    "If using, add aromatics to the broth in the last hour.",
    "Strain the soup, reserve the soup as needed."
  ],
  "notes": [
    "Iekei is a style of ramen invented in Yokohama - a hodgepodge of tonkotsu and shoyu ramens.",
    "The soup is a blend of chicken and pork parts. Some shops push pork more forward, some go evenly.",
    "In the traditional method, raw bones are added throughout cooking, but this recipe adds them in normal stages.",
    "The final soup isn't as emulsified as others - different iekei shops have different levels of emulsification.",
    "Unlike other tonkotsu approaches, this leans into the funk of the bones, so no blanching or soaking is required.",
    "From 'The Book of Ramen' - Chapter 2: Soup"
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}