{
  "id": "jiro-style-tonkotsu-soup",
  "title": "Jiro Style Tonkotsu Soup",
  "source_url": null,
  "yield_servings": 10,
  "total_time_min": 480,
  "tags": ["soup", "broth", "paitan", "japanese", "ramen", "pork", "tonkotsu", "jiro", "chashu"],
  "ingredients": [
    {
      "name": "pork femur bones",
      "amount_g": 2000,
      "amount_oz": 70.5
    },
    {
      "name": "water",
      "amount_g": 4000,
      "amount_oz": 141.1
    },
    {
      "name": "pork shoulder, boneless, cut into 2-3 inch wide strips (or belly)",
      "amount_g": 1500,
      "amount_oz": 52.9
    },
    {
      "name": "pork backfat",
      "amount_g": 500,
      "amount_oz": 17.6
    }
  ],
  "steps": [
    "Optional: to remove funk, blanch the bones by adding them to cold water and bringing to a boil. Most jiro shops avoid this and just skim during phase 2.",
    "Add bones to 4 L water, cook 5 hours at a simmer.",
    "Add pork shoulder and back fat to the pot, cook an additional 2 hours.",
    "Remove now cooked chashu and backfat, checking for doneness. The pork should be tender enough that a chopstick enters easily. When cooked to your textural liking, reserve until needed (for chashu, add to tare; for back fat, chop into pieces and place in container until needed). Boil the soup for another 30 minutes.",
    "Poke femurs interiors with a chopstick or small knife to help release marrow (and allow it to fall back into the pot).",
    "Strain. Should yield around 3 quarts, add water to get to this. Chill soup thoroughly.",
    "For a clearer soup, skim and discard fat that has solidified on top of the soup after chilling. For a cloudier soup, keep all fat and use an immersion blender or jar blender to combine. For in-between, remove some fat."
  ],
  "notes": [
    "The soup is a mix between a paitan and a chintan - feel free to make it really clear or really emulsified.",
    "Critical to success is the method of cooking the chashu and fat in the soup directly - an old school technique that provides additional flavor to the final soup.",
    "The process is the same both ways, you'll just finish it differently based on desired clarity.",
    "Can be made in pressure cooker: 45 minutes at pressure (or 30 minutes with 30-minute natural release) for the initial bones, then add pork and cook for additional 15 minutes.",
    "From 'The Book of Ramen' - Chapter 2: Soup"
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}