{
  "id": "jiro-ramen",
  "title": "Jiro Ramen (Complete Bowl)",
  "source_url": null,
  "yield_servings": 1,
  "total_time_min": 15,
  "tags": ["ramen", "japanese", "complete bowl", "jiro", "pork", "extreme", "main course"],
  "ingredients": [
    {
      "name": "Jiro Style Tonkotsu Soup",
      "amount_g": 300,
      "amount_oz": 10.6
    },
    {
      "name": "Easy Meat Shoyu Tare (Jiro Style)",
      "amount_g": 60,
      "amount_oz": 2.1
    },
    {
      "name": "MSG (optional, for extra umami)",
      "amount_g": 5,
      "amount_oz": null
    },
    {
      "name": "Jiro Noodles",
      "amount_g": 200,
      "amount_oz": 7.1
    },
    {
      "name": "Cabbage, roughly chopped",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Bean sprouts",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Chopped garlic",
      "amount_g": 5,
      "amount_oz": null
    },
    {
      "name": "Cooked fatback from the soup",
      "amount_g": 30,
      "amount_oz": 1.1
    },
    {
      "name": "Chashu slices (optional)",
      "amount_g": null,
      "amount_oz": null
    }
  ],
  "steps": [
    "Preheat your serving bowl by placing it in a 170°F (77°C) oven, or by filling it with hot water.",
    "Prepare all ingredients: roughly chop cabbage, have bean sprouts ready, chop garlic (about 1 tsp), retrieve cooked fatback from the soup.",
    "Bring a large pot of water to a rapid boil for cooking the noodles and vegetables.",
    "Heat the Jiro Style Tonkotsu Soup to a simmer and keep the cooked fatback warm in the soup.",
    "When ready to assemble, empty the preheated bowl and add the Easy Meat Shoyu Tare (60g) to the bottom of the bowl.",
    "If desired, add an extra teaspoon of MSG (about 5g) to the bowl for additional umami.",
    "Add the hot Jiro Style Tonkotsu Soup (300g) to the bowl and stir to combine.",
    "Blanch the cabbage and bean sprouts in the boiling water for about 30 seconds to soften slightly while keeping them crisp.",
    "Remove the vegetables and set aside, keeping them hot.",
    "Immediately cook the Jiro Noodles (200g) in the same boiling water according to the noodle recipe instructions.",
    "When noodles are almost done, re-dunk the blanched vegetables briefly to reheat them.",
    "Drain the noodles thoroughly in a fine mesh strainer, shaking vigorously to remove excess water.",
    "Add the drained noodles to the bowl of soup.",
    "Top with the blanched cabbage and bean sprouts in a large mound.",
    "Add the chopped garlic (about 1 tsp) on top.",
    "Add the cooked fatback (30g) from the soup on top.",
    "Optionally add chashu slices if desired.",
    "Serve immediately while hot."
  ],
  "notes": [
    "Component recipes needed: jiro-style-tonkotsu-soup, easy-meat-shoyu-tare-jiro-style, jiro-noodle",
    "Prepare all component recipes in advance before assembly.",
    "Jiro-style ramen is known for extreme portions and intense flavors - it's not subtle!",
    "The key to Jiro is timing: cook vegetables and noodles separately but quickly to ensure everything is hot when served.",
    "Vegetables should be blanched first, then re-dunked after the noodles are done to keep them hot but crisp.",
    "The fatback is skimmed from the surface of the Jiro soup and adds rich, porky flavor.",
    "Many Jiro shops allow customers to customize their bowl by specifying yasai (vegetables), ninniku (garlic), and abura (fat) amounts.",
    "This is a very hearty, filling bowl - the noodle portion is substantial at 200g.",
    "60 mL of tare equals approximately 60g, 30 mL of fatback equals approximately 30g, 300 mL of soup equals approximately 300g."
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}