{
  "id": "kitakata-style-noodle",
  "title": "Kitakata Style Noodle",
  "source_url": null,
  "yield_servings": 1,
  "total_time_min": 150,
  "tags": ["noodles", "ramen", "japanese", "kitakata", "high-hydration", "wavy", "quick"],
  "ingredients": [
    {
      "name": "King Arthur all purpose flour",
      "amount_g": 95,
      "amount_oz": 3.35
    },
    {
      "name": "tapioca starch",
      "amount_g": 5,
      "amount_oz": 0.18
    },
    {
      "name": "water",
      "amount_g": 45,
      "amount_oz": 1.59
    },
    {
      "name": "salt",
      "amount_g": 1,
      "amount_oz": 0.04
    },
    {
      "name": "baked soda",
      "amount_g": 1.9,
      "amount_oz": 0.07
    }
  ],
  "steps": [
    "Add kansui powder and salt to the water, dissolve completely. If using both sodium carbonate and potassium carbonate, add them one at a time. Go slowly, stir constantly until clear. This will take a while, but eventually, the contents will dissolve. You can make the solution several days before to get a jumpstart, just hold the liquid in an airtight container.",
    "In a standing mixer with a paddle attachment, add your flour and tapioca starch. Turn the mixer to \"stir\" and run for 30 seconds to aerate the mix.",
    "While running the mixer on stir, add two thirds of your water mixture slowly, in an even stream. Let the mixer stir the flour and water mixture for 3 minutes.",
    "Add in the remaining water mixture with the mixer running, run for another minute, until small clumps begin to form.",
    "Turn off the mixer, and add the mixture to a sealable bag. Close, and let this rest for 1 hour at room temperature. Unlike with all other recipes, you can actually skip this, as kitakata noodles are often made by hand in the same day.",
    "Knead it, by using an electric pasta machine to sheet the dough, going through the largest setting, then the 2nd, then the 3rd. Take the dough and fold it, sheeting under the 2nd widest setting, then fold it again and sheet it under the widest setting. Repeat this until the sheet is quite smooth and not ragged.",
    "After kneading, put the dough back in the plastic bag, and rest at room temp for another 30 minutes. You may also skip this, though the noodles will degrade in quality in the fridge if you don't use them quickly.",
    "Pull out your dough. Portion into workable sizes, and roll out to desired thickness using the pasta machine, using potato or cornstarch as you go to prevent sticking.",
    "Grab a sheet around 12 inches long, and cut into noodles approximately 3 mm wide. You can do this by hand, or by a cutter.",
    "Take the noodles and compress them together, sort of like making a snowball, then detangle them, to create a wavy, crinkled pattern.",
    "Bundle the noodles into 150 g portions and place them in a sealable bag. You may use the noodles immediately, or store them in the fridge for a few days."
  ],
  "notes": [
    "This style of ramen is meant to be put together extremely quickly, with noodles being cooked almost as soon as they're cut",
    "High hydration and high kansui amount (primarily sodium) allows for the dough to be noticeably extensible",
    "Additional tapioca is used to help provide structure in the event you want to cook the noodles immediately",
    "Can use noodles the same day (unlike most ramen noodles)",
    "The wavy, crinkled pattern is created by compressing and detangling the noodles"
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}
