{
  "id": "mayu-black-garlic-oil",
  "title": "Mayu (Black Garlic Oil)",
  "source_url": null,
  "yield_servings": null,
  "total_time_min": 25,
  "tags": [
    "aroma oil",
    "oil",
    "fat",
    "ramen",
    "japanese",
    "mayu",
    "garlic",
    "black garlic oil",
    "tonkotsu",
    "kumamoto",
    "stovetop"
  ],
  "ingredients": [
    {
      "name": "garlic cloves",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "oil (equal parts sesame, vegetable oil, and lard - or 100% lard)",
      "amount_g": 54,
      "amount_oz": 1.91
    }
  ],
  "steps": [
    "Take the garlic cloves and process in a food processor until finely minced (around 1/8th inch pieces). You can also mince finely by hand, though avoid turning the garlic into a paste.",
    "Spread the mince on a paper towel and squeeze as much moisture out as possible. Replace paper towels until little to no moisture escapes. This helps dry the mince during cooking.",
    "Heat your oil on the stove. When warm, add your aromatics. You can test this by throwing a small amount of garlic into the oil and seeing if it sizzles.",
    "Cook on medium to medium-high heat, stirring constantly, until the garlic takes on a dark brown, almost black color, and the oil begins to smoke, around 15-20 minutes.",
    "Strain the solids, reserving the oil, and then lay the solids on more paper towels to remove excess oil. This keeps things as dry and brittle as possible. You should be left with garlic pieces that you can crumble into dust between your fingers.",
    "Add your solids only to a mortar and pestle, and mash until the oil within them begins to escape and the contents turn into a uniform paste. This takes around 5 minutes.",
    "Once the paste is smooth with no visible grit, add the reserved oil from step 5 to thin the mayu to your liking and mix fully.",
    "Store in an airtight container until ready to use. If not using immediately, keep in the fridge for up to 6 months."
  ],
  "notes": [
    "Mayu is a very dark, almost black, aroma oil commonly used in southern-style tonkotsu based ramen, particularly from the Kumamoto region.",
    "It has a bitter, slightly acrid taste, and should be used sparingly for visual contrast and aromatic complexity.",
    "Mayu is a colloid where solid particles are dispersed in oil (different from an emulsion where liquid is dispersed in liquid).",
    "To make a stable mayu, the dispersed particles (cooked solids) must be very small so they become indefinitely suspended in the oil.",
    "A mortar and pestle works better than a food processor or blender. A suribachi (Japanese mortar and pestle) is even better due to its ridges.",
    "Keeping ingredients dry helps create better suspension. Moisture prolongs frying and results in soggier fried vegetables that are harder to grind.",
    "60 mL is approximately 0.25 cup, converted to approximately 54 grams.",
    "Recipe calls for 15 cloves of garlic.",
    "100% lard is nice but will firm up at room temperature, so a blend with sesame and vegetable oil is recommended.",
    "Store in the fridge for up to 6 months."
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}
