{
  "id": "mazesoba-soupless-ramen-noodle",
  "title": "Mazesoba / Soupless Ramen Noodle",
  "source_url": null,
  "yield_servings": 1,
  "total_time_min": 150,
  "tags": ["noodles", "ramen", "japanese", "mazesoba", "soupless", "egg", "italian-inspired"],
  "ingredients": [
    {
      "name": "all purpose flour",
      "amount_g": 100,
      "amount_oz": 3.53
    },
    {
      "name": "whole fresh egg",
      "amount_g": 14,
      "amount_oz": 0.49
    },
    {
      "name": "water",
      "amount_g": 24,
      "amount_oz": 0.85
    },
    {
      "name": "salt",
      "amount_g": 1,
      "amount_oz": 0.04
    },
    {
      "name": "baked soda or powdered kansui",
      "amount_g": 1,
      "amount_oz": 0.04
    },
    {
      "name": "riboflavin (optional)",
      "amount_g": 0.01,
      "amount_oz": 0.0
    }
  ],
  "steps": [
    "Add kansui powder and salt to the water (and riboflavin if using), dissolve completely. If using both sodium carbonate and potassium carbonate, add them one at a time. Go slowly, stir constantly until clear. This will take a while, but eventually, the contents will dissolve. You can make the solution several days before to get a jumpstart, just hold the liquid in an airtight container.",
    "Add the whole fresh egg to the solution, mix until fully incorporated.",
    "In a standing mixer with a paddle attachment, add your flour. Turn the mixer to \"stir\" and run for 30 seconds to aerate the mix.",
    "While running the mixer on stir, add two-thirds of your water mixture slowly, in an even stream. Let the mixer stir the flour and water mixture for 3 minutes.",
    "Add in the remaining water mixture with the mixer running, run for another minute, until small clumps begin to form.",
    "Turn off the mixer, and add the mixture to a sealable bag. Close, and let this rest for 1 hour at room temperature. Don't skip this.",
    "Knead it, by using an electric pasta machine to sheet the dough, going through the largest setting, then the 2nd, then the 3rd. Take the dough and fold it, sheeting under the 2nd widest setting, then fold it again and sheet it under the widest setting. Repeat this until the sheet is quite smooth and not ragged.",
    "After kneading, put the dough back in the plastic bag, and rest at room temp for another 30 minutes.",
    "Pull out your dough. Portion into workable sizes, and roll out to desired thickness, using potato or cornstarch as you go to prevent sticking.",
    "Cut your noodles to your desired thickness. 2 mm by 2 mm is standard for these, though you can go as thick as you'd like here.",
    "Bundle the noodles into 180 g portions and place them in a sealable bag. Put the bag in the fridge and allow it to rest for at least a day."
  ],
  "notes": [
    "Mazesoba noodles are used for dishes that don't contain soup",
    "Borrows from Italian pasta ideas: using lower protein flour and increased egg content",
    "All purpose flour is suitable because the egg provides more structure than in a standard ramen dough",
    "Using egg yolk tenderizes the dough, as fat prohibits some gluten formation, making this dough easier to work with",
    "High egg content makes noodles resilient in cooking, the egg white helping reduce overcooking potential",
    "Total hydration including fresh egg is around 36%. If using powdered egg, use 36 g water and 3 g egg powder",
    "Around 1 egg for every 300 g flour",
    "The egg yolk from the whole egg will provide some amount of color, but not as much as in true egg-pastas, so some dye helps",
    "These noodles will oxidize and darken in appearance considerably if left in the fridge for more than 2-3 days, so for long term storage, freezing is recommended",
    "If using powdered kansui, use 0.8 g sodium carbonate and 0.2 g potassium carbonate"
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}
