{
  "id": "new-wave-shoyu-ramen",
  "title": "New Wave Shoyu Ramen (Complete Bowl)",
  "source_url": null,
  "yield_servings": 1,
  "total_time_min": 10,
  "tags": ["ramen", "japanese", "complete bowl", "shoyu", "new wave", "main course"],
  "ingredients": [
    {
      "name": "New Wave Chicken Chintan broth",
      "amount_g": 350,
      "amount_oz": 12.3
    },
    {
      "name": "New Wave Shoyu Tare",
      "amount_g": 35,
      "amount_oz": 1.2
    },
    {
      "name": "Tamari (optional)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Chicken Fat (half at bottom, half on top)",
      "amount_g": 30,
      "amount_oz": 1.1
    },
    {
      "name": "New Wave Tokyo Style Noodles",
      "amount_g": 130,
      "amount_oz": 4.6
    },
    {
      "name": "Chashu slices (optional)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Soft-boiled egg, halved (optional)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Green onions, sliced (optional)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Nori sheet (optional)",
      "amount_g": null,
      "amount_oz": null
    }
  ],
  "steps": [
    "Preheat your serving bowl by placing it in a 170°F (77°C) oven, or by filling it with hot water.",
    "Prepare all toppings and have them ready (slice chashu, halve eggs, slice green onions).",
    "Bring a large pot of water to a rapid boil for cooking the noodles.",
    "Heat the New Wave Chicken Chintan broth to a simmer.",
    "When ready to assemble, empty the preheated bowl and add the New Wave Shoyu Tare (35g) to the bottom of the bowl.",
    "Add half of the Chicken Fat (15g) to the bottom of the bowl.",
    "If using, add a few drops of tamari for extra depth.",
    "Add the hot New Wave Chicken Chintan broth (350g) to the bowl and stir to combine.",
    "Cook the New Wave Tokyo Style Noodles (130g) in the boiling water according to the noodle recipe instructions.",
    "When noodles are done, immediately drain them thoroughly in a fine mesh strainer, shaking vigorously to remove excess water.",
    "Add the drained noodles to the bowl of soup. Use chopsticks to separate and arrange the noodles if desired.",
    "Add the remaining Chicken Fat (15g) on top of the noodles.",
    "Add toppings: place chashu at 6 o'clock position, egg at 11-12 o'clock, green onions in the center, and nori at 1-2 o'clock (add nori last as it gets soggy quickly).",
    "Serve immediately while hot."
  ],
  "notes": [
    "Component recipes needed: new-wave-chicken-chintan, new-wave-shoyu-tare, chicken-fat-stovetop or chicken-fat-microwave, new-wave-tokyo-style-noodle",
    "Prepare all component recipes in advance before assembly.",
    "This is a modern interpretation of shoyu ramen with a richer, more refined flavor profile.",
    "The chicken fat is split - half goes in the bottom with the tare, half on top after the noodles for aromatic appeal.",
    "Work quickly when adding noodles to prevent them from becoming sticky or overcooked.",
    "35 mL of tare equals approximately 35g, 30 mL of chicken fat equals approximately 30g, 350 mL of broth equals approximately 350g."
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}