{
  "id": "shio-ramen",
  "title": "Shio Ramen (Complete Bowl)",
  "source_url": null,
  "yield_servings": 1,
  "total_time_min": 10,
  "tags": ["ramen", "japanese", "complete bowl", "shio", "main course"],
  "ingredients": [
    {
      "name": "All-Purpose Chintan broth",
      "amount_g": 350,
      "amount_oz": 12.3
    },
    {
      "name": "White Wine Chicken Shio Tare",
      "amount_g": 30,
      "amount_oz": 1.1
    },
    {
      "name": "All-Purpose Scallion Oil",
      "amount_g": 15,
      "amount_oz": 0.5
    },
    {
      "name": "Tokyo Style Noodles",
      "amount_g": 135,
      "amount_oz": 4.8
    },
    {
      "name": "Chashu slices (optional)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Soft-boiled egg, halved (optional)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Green onions, sliced (optional)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Nori sheet (optional)",
      "amount_g": null,
      "amount_oz": null
    }
  ],
  "steps": [
    "Preheat your serving bowl by placing it in a 170°F (77°C) oven, or by filling it with hot water.",
    "Prepare all toppings and have them ready (slice chashu, halve eggs, slice green onions).",
    "Bring a large pot of water to a rapid boil for cooking the noodles.",
    "Heat the All-Purpose Chintan broth to a simmer.",
    "When ready to assemble, empty the preheated bowl and add the White Wine Chicken Shio Tare (30g) to the bottom of the bowl.",
    "Add the All-Purpose Scallion Oil (15g) to the bowl.",
    "Add the hot All-Purpose Chintan broth (350g) to the bowl and stir to combine the tare and oil.",
    "Cook the Tokyo Style Noodles (135g) in the boiling water according to the noodle recipe instructions (typically 1-2 minutes).",
    "When noodles are done, immediately drain them thoroughly in a fine mesh strainer, shaking vigorously to remove excess water.",
    "Add the drained noodles to the bowl of soup. Use chopsticks to separate and arrange the noodles if desired.",
    "Add toppings: place chashu at 6 o'clock position, egg at 11-12 o'clock, green onions in the center, and nori at 1-2 o'clock (add nori last as it gets soggy quickly).",
    "Serve immediately while hot."
  ],
  "notes": [
    "Component recipes needed: all-purpose-chintan, white-wine-chicken-shio, all-purpose-negi-scallion-oil, tokyo-style-noodle",
    "Prepare all component recipes in advance before assembly.",
    "Shio (salt) ramen is known for its clear, delicate broth that showcases the quality of the ingredients.",
    "This style highlights the natural flavors of the chicken and seafood in the broth.",
    "Work quickly when adding noodles to prevent them from becoming sticky or overcooked.",
    "30 mL of tare equals approximately 30g, 15 mL of oil equals approximately 15g, 350 mL of broth equals approximately 350g."
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}