{
  "id": "soft-boiled-eggs",
  "title": "Soft Boiled Eggs (Ajitama/Ajidama)",
  "source_url": null,
  "yield_servings": 6,
  "total_time_min": 30,
  "tags": ["topping", "ramen", "japanese", "egg", "protein", "no-cook"],
  "ingredients": [
    {
      "name": "high-quality large chicken eggs",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "water (for boiling)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "ice",
      "amount_g": null,
      "amount_oz": null
    }
  ],
  "steps": [
    "Bring a large pot of water to a full boil.",
    "In a large bowl or container, fill with ice and cold water to make an ice bath. Reserve.",
    "Remove eggs from the refrigerator. Optionally, using a thumbtack or the heel of a knife, poke a small hole or divot in the bottom of the wider side of the egg. This step has the benefit of allowing the albumen to expand in the shell, preventing cracking, and helps with the overall shape of the egg. It's optional, but if you're having trouble with eggs cracking, or having eggs that are hard to peel, this step can help. Sort of a shop secret.",
    "Working in batches of 4-6 eggs at a time, to avoid the water temperature dropping too quickly, lower your eggs into the boiling water.",
    "Boil the eggs, stirring occasionally during the first minute or so of cooking, for 6-7 minutes, depending on how firm you'd like the yolk. 7 minutes gives a slightly custardy yolk. For a completely liquid yolk, cook for 6 minutes to 6 minutes 30 seconds.",
    "After the time is up, quickly remove the eggs from the water and place them in the ice bath from step 2. Hold for 15 minutes, or until thoroughly chilled. This process, called shocking, prevents additional carry-over cooking (the exterior of the egg is much hotter than the interior), making sure the white is fully cooked without allowing the yolk to cook more than necessary.",
    "Peel, then proceed with the steeping method below or use as is."
  ],
  "notes": [
    "Soft boiled eggs are delicious on their own and can be used unsteeped in ramen.",
    "The eggs can be sliced in half to expose the yolk or kept whole.",
    "After peeling, eggs can be steeped using either the Quick and Easy Brine or Equilibrium Brine method.",
    "Time is related to the square of the seasoning's distance into the egg. If it takes 1 hour for brine to penetrate 1mm, it will take 4 hours for 2mm, and 9 hours for 3mm.",
    "Different shops name them different things based on preparation: Ajitama, Ajidama, Tsuketamago, Ajitamago, or Hanjukutamago."
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}
