{
  "id": "soup-clarification-technique",
  "title": "Soup Clarification Technique (Raft Method)",
  "source_url": null,
  "yield_servings": null,
  "total_time_min": 60,
  "tags": ["soup", "broth", "technique", "japanese", "ramen", "advanced", "chintan", "clarification"],
  "ingredients": [
    {
      "name": "egg whites with shells, crushed, lightly whipped together",
      "amount_g": 150,
      "amount_oz": 5.3
    },
    {
      "name": "ground chicken (or ground pork)",
      "amount_g": 500,
      "amount_oz": 17.6
    },
    {
      "name": "soup for clarifying (at least 4 L), all fat removed",
      "amount_g": 4000,
      "amount_oz": 141.1
    }
  ],
  "steps": [
    "Combine the egg whites and ground chicken, set aside.",
    "Bring the soup to a simmer.",
    "Add the egg white and ground chicken mixture to the soup, whisking thoroughly to allow the mixture to disperse.",
    "Once dispersed, stop whisking and bring the soup back to a simmer. Allow a raft of coagulated meat and egg to form.",
    "Allow the soup to cook for 15-30 minutes at a simmer, or until desired clarity is reached.",
    "Carefully strain the soup, ideally without disturbing the raft. Some opt to line a strainer with cheesecloth to discard the raft first, others use a ladle to scoop the soup from the top of the raft bit by bit."
  ],
  "notes": [
    "Use when you accidentally over-boil the soup and create unwanted emulsification, or wish for soup to be even clearer.",
    "Clarification in ramen is rare, most likely due to effort required at volume and relatively low payoff.",
    "Achieves extremely high clarity, almost to the point of being alarmingly crystal clear.",
    "The process can remove some flavor compounds - most guests will still respect a 'very' clear soup vs completely clear.",
    "Uses the 'raft' method - combination of egg whites and ground meat creates a floating raft on the surface.",
    "As soup boils, it rises and falls through the raft, and the network of coagulated proteins traps globules of fat and debris.",
    "Some methods use acidifying agents to improve clarification, but this will add further flavor to the soup.",
    "Daniel Gritzer at Serious Eats suggests leaving scum improves clarification as debris gets trapped in mesh of proteins, only minimally affecting soup color.",
    "Falls into diminishing returns - most ramen soups are not this clear. Don't sweat it.",
    "From 'The Book of Ramen' - Chapter 2: Soup"
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}