{
  "id": "tantanmen-ramen",
  "title": "Tantanmen (Japanese Dan Dan Noodles Complete Bowl)",
  "source_url": null,
  "yield_servings": 1,
  "total_time_min": 10,
  "tags": ["ramen", "japanese", "complete bowl", "tantanmen", "spicy", "chinese", "main course"],
  "ingredients": [
    {
      "name": "All-Purpose Chintan broth",
      "amount_g": 350,
      "amount_oz": 12.3
    },
    {
      "name": "Tantanmen Tare (one serving)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Chili Oil",
      "amount_g": 15,
      "amount_oz": 0.5
    },
    {
      "name": "Spice Blend (start with 1 tsp, adjust to taste)",
      "amount_g": 5,
      "amount_oz": null
    },
    {
      "name": "Makeshift-Hakata Style Noodles or Tokyo Style Noodles",
      "amount_g": 135,
      "amount_oz": 4.8
    },
    {
      "name": "Ground pork or pork soboro (optional)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Bok choy or spinach, blanched (optional)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Soft-boiled egg, halved (optional)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Green onions, sliced (optional)",
      "amount_g": null,
      "amount_oz": null
    }
  ],
  "steps": [
    "Preheat your serving bowl by placing it in a 170°F (77°C) oven, or by filling it with hot water.",
    "Prepare all toppings and have them ready (cook ground pork soboro if using, blanch bok choy, halve eggs, slice green onions).",
    "Bring a large pot of water to a rapid boil for cooking the noodles.",
    "Heat the All-Purpose Chintan broth to a simmer.",
    "When ready to assemble, empty the preheated bowl and add one serving of Tantanmen Tare to the bottom of the bowl.",
    "Add the Chili Oil (15g) to the bowl.",
    "Add the Spice Blend (start with 1 tsp, about 5g) to the bowl - adjust amount based on desired heat level.",
    "Add the hot All-Purpose Chintan broth (350g) to the bowl and whisk vigorously to fully incorporate the thick tare and spices.",
    "Cook the noodles (130-140g) in the boiling water according to the noodle recipe instructions.",
    "When noodles are done, immediately drain them thoroughly in a fine mesh strainer, shaking vigorously to remove excess water.",
    "Add the drained noodles to the bowl of soup. Use chopsticks to separate and arrange the noodles if desired.",
    "Add toppings: place ground pork soboro in the center, bok choy or spinach on the side, egg if using, and green onions on top.",
    "Serve immediately while hot. Diners should mix the ingredients well before eating."
  ],
  "notes": [
    "Component recipes needed: all-purpose-chintan, tantanmen-tare, chili-oil, spice-blend, makeshift-hakata-style-noodle or tokyo-style-noodle",
    "Optional: pork-soboro for topping",
    "Prepare all component recipes in advance before assembly.",
    "Tantanmen is the Japanese version of Sichuan dan dan noodles, featuring a creamy, spicy sesame broth.",
    "The tare in this recipe is very thick (contains sesame paste, tahini, or peanut butter), so thorough whisking is essential.",
    "Start with 1 tsp of spice blend and increase gradually to suit your heat tolerance.",
    "You can use either Makeshift-Hakata Style Noodles (130g) or Tokyo Style Noodles (140g).",
    "15 mL of chili oil equals approximately 15g, 350 mL of broth equals approximately 350g."
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}