{
  "id": "tonkotsu-gyokai-tsukemen",
  "title": "Tonkotsu Gyokai Tsukemen (Dipping Noodles Complete Bowl)",
  "source_url": null,
  "yield_servings": 1,
  "total_time_min": 15,
  "tags": ["ramen", "japanese", "complete bowl", "tsukemen", "tonkotsu", "seafood", "dipping noodles", "main course"],
  "ingredients": [
    {
      "name": "Tsukemen Thick Soup",
      "amount_g": 250,
      "amount_oz": 8.8
    },
    {
      "name": "Toasted Shoyu Tare",
      "amount_g": 30,
      "amount_oz": 1.1
    },
    {
      "name": "Gyofun (fish powder)",
      "amount_g": 10,
      "amount_oz": 0.4
    },
    {
      "name": "Black pepper, freshly ground",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Thick Tsukemen Noodles",
      "amount_g": 200,
      "amount_oz": 7.1
    },
    {
      "name": "Chashu slices (optional)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Soft-boiled egg, halved (optional)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Menma (bamboo shoots) (optional)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Green onions, sliced (optional)",
      "amount_g": null,
      "amount_oz": null
    },
    {
      "name": "Nori sheet (optional)",
      "amount_g": null,
      "amount_oz": null
    }
  ],
  "steps": [
    "Preheat your serving bowl (for the dipping soup) by placing it in a 170°F (77°C) oven, or by filling it with hot water.",
    "Prepare a separate large bowl or plate for serving the noodles.",
    "Prepare all toppings and have them ready (slice chashu, halve eggs, prepare menma, slice green onions).",
    "Bring a large pot of water to a rapid boil for cooking the noodles.",
    "Heat the Tsukemen Thick Soup to a simmer.",
    "When ready to assemble, empty the preheated bowl and add the Toasted Shoyu Tare (30g) to the bottom of the bowl.",
    "Add the gyofun (10g, approximately 2 tsp) to the bowl.",
    "Add a few grinds of black pepper to the bowl.",
    "Add the hot Tsukemen Thick Soup (250g) to the bowl and stir to combine all ingredients.",
    "Cook the Thick Tsukemen Noodles (200g or more) in the boiling water according to the noodle recipe instructions.",
    "When noodles are done, immediately drain them and shock them thoroughly in ice water to stop the cooking and firm them up.",
    "Drain the chilled noodles thoroughly and arrange them on a separate plate or in a shallow bowl.",
    "Add toppings to the dipping soup or arrange them on the noodle plate: chashu, egg, menma, green onions, and nori.",
    "Serve immediately - diners should dip the cold noodles into the hot soup while eating."
  ],
  "notes": [
    "Component recipes needed: tsukemen-thick-soup, toasted-shoyu-tare, thick-tsukemen-noodle",
    "Prepare all component recipes in advance before assembly.",
    "Tsukemen is a dipping-style ramen where cold noodles are served separately from a concentrated hot soup.",
    "The soup has lower volume (250mL vs 300-350mL) but higher salinity to compensate for the dipping method.",
    "Gyokai refers to seafood elements - gyofun is fish powder that adds umami depth.",
    "The noodles must be shocked in ice water after cooking - this is critical for tsukemen texture.",
    "The noodle portion is larger (200g+) since there's no soup to fill you up.",
    "After finishing the noodles, it's traditional to add hot soup stock (soup-wari) to dilute the remaining dipping soup and drink it.",
    "10 mL of gyofun equals approximately 10g, 30 mL of tare equals approximately 30g, 250 mL of soup equals approximately 250g."
  ],
  "created_at": "2025-11-18",
  "last_updated_at": "2025-11-18"
}