{
  "id": "watermelon-gazpacho",
  "title": "Watermelon Gazpacho",
  "yield_servings": 8,
  "total_time_min": 185,
  "tags": [
    "soup",
    "summer",
    "vegetarian",
    "gluten-free",
    "no-cook",
    "wife's favorite"
  ],
  "ingredients": [
    {
      "name": "watermelon, roughly diced",
      "amount_g": 840,
      "amount_oz": 30
    },
    {
      "name": "tomatoes, roughly diced",
      "amount_g": 400,
      "amount_oz": 14
    },
    {
      "name": "cucumber, roughly diced",
      "amount_g": 400,
      "amount_oz": 14
    },
    {
      "name": "red onion, roughly diced",
      "amount_g": 110,
      "amount_oz": 4
    },
    {
      "name": "toasted almonds",
      "amount_g": 60,
      "amount_oz": 2
    },
    {
      "name": "kosher salt, plus more to taste",
      "amount_g": 12,
      "amount_oz": 0.4
    },
    {
      "name": "freshly ground black pepper",
      "amount_g": 1,
      "amount_oz": 0.04
    },
    {
      "name": "sherry vinegar",
      "amount_g": 30,
      "amount_oz": 1
    },
    {
      "name": "extra-virgin olive oil (use the best you can find)",
      "amount_g": 60,
      "amount_oz": 2
    },
    {
      "name": "crema (or Greek yogurt, sour cream, or buttermilk)",
      "amount_g": 75,
      "amount_oz": 2.7
    },
    {
      "name": "Calabrian chiles, chopped",
      "amount_g": 15,
      "amount_oz": 0.5
    }
  ],
  "steps": [
    "In a large bowl, toss together watermelon, tomatoes, cucumber, red onion, almonds, kosher salt, and pepper. Set aside to marinate for about 1 hour.",
    "In a blender, working in batches, purée vegetables and their liquid until smooth and creamy.",
    "Transfer soup to a large bowl. Whisk in sherry vinegar and olive oil. Adjust seasoning with salt and pepper to taste.",
    "Cover soup and chill in refrigerator for at least 2 hours or up to 3 days.",
    "When ready to serve, adjust seasoning again with salt and pepper to taste.",
    "Combine crema and chopped Calabrian chiles in a small bowl.",
    "Ladle chilled soup into bowls and garnish with the crema mixture. Optionally garnish with additional diced vegetables."
  ],
  "notes": [
    "Salting the vegetables in advance breaks down their cell walls, extracting more flavor.",
    "Toasted almonds add texture and body without the heaviness of traditional bread.",
    "Tangy crema and spicy Calabrian chiles balance the sweetness of the watermelon.",
    "Crema's lighter body makes it easy to drizzle - Greek yogurt, sour cream, or buttermilk also work."
  ],
  "created_at": "2025-11-25",
  "last_updated_at": "2025-11-25"
}